<?php
	$page->title = 'Η εταιρία';
	$page->sidebar = '<img src="assets/images/company200.jpg" alt="" />';
?>


<h1>Η εταιρεία</h1>

<p>Η εταιρεία x-color δραστηριοποιείται και εξειδικεύεται 
στα βερνίκια επιπλοποιίας καθώς και σε ειδικά εφέ και τεχνοτροπίες. 
Η πολύχρονη πείρα μας παρέχει λύσεις ακόμη και στις πιο δύσκολες 
και απαιτητικές συνθήκες. 

<h2>Προϊόντα</h2>

<p>Η υψηλή ποιότητα των προϊόντων μας εξασφαλίζει το άριστο 
αποτέλεσμα στην εφαρμογή τους  σε οποιοδήποτε είδος επιφάνειας 
για οποιαδήποτε χρήση εσείς επιλέξετε (συντήρηση - εμφάνιση - αντοχή). 
Τα προϊόντα μας κινούνται με γνώμονα τον άνθρωπο και το περιβάλλον 
και συνοδεύονται με διεθνώς αναγνωρισμένα πιστοποιητικά.<p>


<h2>Συνεργασίες</h2>

<p>Η εταιρεία x-color προμηθεύεται τα προϊόντα της από καταξιωμένες 
Ιταλικές εταιρείες βερνικιών και εφέ. Η συνεργασία μας με εταιρείες 
που συνδυάζουν την πολυετή εμπειρία με την ερευνητική δραστηριότητα, 
εγγυάται την άριστη και υψηλή ποιότητα των προϊόντων μας.


<h2>Στόχος</h2>

<p>Η διαρκής βελτίωση των προϊόντων μας, η άμεση τεχνική υποστήριξη και η άρτια εξυπηρέτηση των πελατών μας</p>


