<?php
	$title = 'Page';
	$description = <<<'EOT'
		Είναι ένα αντικείμενο σελίδας. Φορτώνεται από αρχεία στο cms/pages. 

		Αυτά περιέχουν το κυρίως κείμενο ως html με πιθανά κάποια κομμάτια php. 

		Στην αρχή του αρχείου μπορούμε να δηλώσουμε properties στο αντικείμενο Page που υπάρχει με την μεταβλητή $page, όπως πχ. $page->title = "xxx"

EOT;

	$properties = array(
		'title'=>'Ο τίτλος της σελίδας',
		'template'=>'Το template που πιθανά θέλει η σελίδα. Αν είναι άδειο, χρησιμοποιείται το default',
		'keywords'=>'Το meta keywords για την συγκεκριμένη σελίδα. Αν είναι άδειο, χρησιμοποιείται το default',
		'description'=>'Το meta description για την συγκεκριμένη σελίδα. Αν είναι άδειο, χρησιμοποιείται το default',
		'image'=>'Συκεκριμένη εικόνα για την σελίδα, μπορεί να την χειριστεί το template όπως θέλει',
		'text'=>'Το κείμενο που φορτώνεται από την html',
		'path'=>'Το request path της σελίδας, χρήσιμο για την δημιουργία links',
		'mtime'=>'το modification timestamp της σελίδας',
	);
